<?php

return [
    'error' => [
        'password' => 'Не веррно введены Логин или Пароль.',
        'login_two' => 'Вы авторизованный пользователь! При необходимости изменить пользователя, требуется выйти из текущей учетной записи!',
        'login_unique' => 'Пользователь с таким именем уже зарегистрирован в системе! Придумайте уникальное имя.',
        'email_unique' => 'Данный e-mail уже зарегистрирован в системе! Используйте другой e-mail.',
        'post_long'   =>  'Превышена длина записи! Требуется уменьшить количество символов.',
        'email_format' => 'Не верный формат электронной почты!',
        'hold' =>   'Пользователь ожидает проверки.',
        'stop' =>   'Пользователь заблокирован.',
        'firstKey' => 'Ошибка ключа! Ключ заблокирован либо отсутствует.',
        'password_key' => 'Не верный формат пароля. Измени пароль и повторите попытку.',
        'not_found' => 'Один из выбранных пользователей не найден',
        'api_access' => 'Не верный ключ доступа',
        'params' => 'Не верно указаны параметры.',
        'access' => 'Не достаточно прав доступа!',
        'auth_key' => 'Не верный ключ авторизации',
    ],
    'success' => [
        'login'   => 'Авторизация успешно пройдена.',
        'logout'    => 'Вы успешно покинули личный кабинет!',
        'firstKey' => 'Ключ успешно принят! Измените Пароль.',
        'firstKeyChange' => 'Успех! Ключ аннулирован. Пароль успешно присвоен/изменен.',
    ],
];